---

C#Visual BasicVisual C++

Revit 2024 API
---
CurtainSystem..::..AddCurtainGrid Method
CurtainSystem Class See Also Send Feedback
---

Add CurtainGrid on the specified face for the CurtainSystem.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public void AddCurtainGrid(
    	Reference face
    )

Visual Basic
---

    Public Sub AddCurtainGrid ( _
    	face As Reference _
    )

Visual C++
---

    public:
    void AddCurtainGrid(
    	Reference^ face
    )

#### Parameters

face
    Type: Autodesk.Revit.DB..::..ReferenceThe face new CurtainGrid will be created on.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input argument face is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when creating CurtainGrid on the specified face fails or regenerate fails. |

# See Also

CurtainSystem Class

Autodesk.Revit.DB Namespace